#+TITLE:Data science on the command line - Regular expressions
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:Introduction to advanced data science
#+STARTUP:overview hideblocks indent inlineimages
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:bash :exports both :results output
#+PROPERTY: header-args:sh :exports both :results output
#+PROPERTY: header-args:R :exports both :results output :session *R*
* Quantifiers ~*~ ~+~ ~?~ ~{}~

- ~abc*~ matches a string that has ~ab~ followed by zero or more ~c~:
  #+begin_src R
    ## all words with 'cre' followed by zero or more 'a'
    shell("cat bar.txt | grep crea*")
  #+end_src

  #+RESULTS:
  : STDIN
  : creaturae
  : creaturae
  : crediderunt
  : credent
  : credens

- ~abc+~ matches a string that has ~ab~ followed by one or more ~c~:
  #+begin_src R
    ## all words with 'cre' followed by one or more 'a'
    shell("cat bar.txt | grep crea+") 
  #+end_src

  #+RESULTS:
  : STDIN
  : creaturae
  : creaturae
  
- ~abc?~ matches a string that has ~ab~ followed by zero or one ~c~:
  #+begin_src R
    ## all words with 'su' followed by zero or one 'a'
    shell("cat bar.txt | grep sua?") 
  #+end_src

  #+RESULTS:
  : STDIN
  : suam
  : sui
  : superbis

- ~abc{2}~ matches a string that has ~ab~ followed by 2 ~c~:
   
- ~abc{2,}~ matches a string that has ~ab~ followed by 2 or more ~c~

- ~abc{2,5}~ matches a string that has ~ab~ followed by 2 up to 5 ~c~

- ~a(bc)*~ matches a string that has ~a~ followed by zero or more ~bc~

- ~a(bc){2,5}~ matches a string that has a followed by 2 up to 5 ~bc~

